Revit 2027 API
PipePressureDropData.CategoryId Property
 The category id of pipe curves. It will be OST_PipeCurves, OST_FlexPipeCurves, or OST_PlaceHolderPipes.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId { get; }
Public ReadOnly Property CategoryId As ElementId
	Get
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
member CategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace